NguyenDuyThan/STM32_GPS_GSM/iTracking_Firmware/src/main.c
#include <datastruct.pb.h>
#include "stm32f10x.h"
#include "FreeRTOS.h"
#include "task.h"
#include "string.h"
#include "stdlib.h"
#include "stdio.h"
#include "time.h"

#include "datastruct.pb.h"
#include "pb_encode.h"
#include "pb_decode.h"
#include "pb.h"
#include "pb_common.h"

#define FAST_I2C_MODE
#define Slave_Address 0x68
#define BufferSIZE 3
#define Buzzer		GPIO_Pin_12
#define GSM_LED		GPIO_Pin_5
#define GPS_LED		GPIO_Pin_5
#define PWR_GPS		GPIO_Pin_8
#define PWR_GSM		GPIO_Pin_1
#define GSM_RST_Pin	GPIO_Pin_3
#define GSM_RST_Port	GPIOC

#define msgsize	512
#define bufLogSize	1024
#define bufRxDataUart2Size	1024
#define bufRxDataUart1Size	1024
#define bufRxDataUart3Size   1024

#define chuoiConnect	 "CONNECT {\"verbose\":true,\"pedantic\":false,\"ssl_required\":false,\"auth_token\":\"2I8080bT86aQD45vQkZk1UvVGvrU3qEE\",\"name\":\"1410974732\",\"lang\":\"c\",\"version\":\"2.10_DVS\"}\r\n"
#define debugA	0

#define debugInfo(msg)	debugPrintCB("[InFor] ", __func__, msg, debugWriteLog)
#define debugWarn(msg)	debugPrintCB("[Warn] ", __func__, msg, debugWriteLog)
#define debugError(msg)	debugPrintCB("[ERROR] ", __func__, msg, debugWriteLog)
#define findStrSim(strfind, time)	checkStrCB(bufRxDataUart2, strfind, time, checkStr)
#define cmdCtrl(cmd)	checkCmd(bufRxDataUart1, cmd, 1)
#define debugBufQTM95(buf)	debugPrintCB("\tBuffer Received: ", __func__, buf, debugWriteLog)
#define resetBufQTM95()	resetBuf( bufRxDataUart2, &indexBufRxDataUart2, bufRxDataUart2Size)
/**********************************************************************************/
typedef void (*printcb)(char *, const char *, char *);
typedef int (*checkStrcb)(char *, char *, int);
/***** Debug ****/
int indexBufRxDataUart1 = 0;
char bufRxDataUart1[bufRxDataUart1Size];
char bufLog[bufLogSize];
int indexBufLog = 0;
/***** SIM *****/
int indexBufRxDataUart2 = 0;
char bufRxDataUart2[bufRxDataUart2Size];

char strPub[msgsize];
char strPubSend[msgsize];

char msgQIRD[msgDataSend_size + 50];
char lenTCP[5];
char strTCP[msgDataSend_size + 40];
char strMSG[msgDataSend_size + 30];

struct debugFlag {
	int log;
	int test;
};
struct debugFlag dbQuecTelM95, db;

typedef struct sysFlag_t {
	volatile int runOpen;
	volatile int sendSub;
	volatile int sendPub;
	volatile int dataOther;
	volatile int QIRDI;
	volatile int tcp;
	volatile int nat;
	volatile int ping;
} sysFlag;
sysFlag QTM95;

typedef struct msgFlag_t {
	int len;
	char data[msgsize];
	int part;
	int new;
} msgFlag;
msgFlag msg;
msgDataSend msgDataLocal;
msgDataSend msgDataServer;

enum cmdEnum {
	NotFound = 0, sendPUB, sendSUB, run, resetQTM95, test, QIRDI,
};
enum cmdEnum cmd;
enum statusQTM95Enum {
	NotRespond, Good, Warn,
};
enum statusQTM95Enum statusQTM95;

/************ I2C ************/
volatile uint8_t MasterTxBuffer[BufferSIZE] = { 1, 2, 3 };
volatile uint8_t MasterRxBuffer[BufferSIZE];
volatile uint8_t SlaveTxBuffer[BufferSIZE] = { 4, 5, 6 };
volatile uint8_t SlaveRxBuffer[BufferSIZE];
/***** GPS *****/
int gpggalenght = 0;
int gpgsalenght = 0;
int gprmclenght = 0;

int indexBufRxDataUart3 = 0;
char bufRxDataUart3[bufRxDataUart3Size];
char chuoiphanbiet[5];
char GPGGA[90];
char GPRMC[90];
char GPGSA[90];
char GPVTG[90];
char gpgga[5] = "GPGGA";
char gpgsa[5] = "GPGSA";
char gprmc[5] = "GPRMC";
char gpvtg[5] = "GPVTG";
char chuoitrichra[90];
char *chuoicontro;
/*****************************************************************************/
void GPIO_Configuration(void);
void USARTx_Configuration(USART_TypeDef* USARTx);
void NVIC_Configuration(void);

static void TaskA(void *pvParameters);
static void TaskB(void *pvParameters);
static void TaskC(void *pvParameters);
static void TaskD(void *pvParameters);

extern void splitDataGPS();
extern void getDataUart1();
extern void getDataUart2();

void USARTx_SendString(USART_TypeDef* USARTx, char *Str);
void debugPrintCB(char *label, const char *title, char *Str, printcb endcb);

int checkStrCB(char *source, char *Strs, int time, checkStrcb endcheckStrcb);
void GSM_Cmd(char *AT);

void debugWriteLog(char *label, const char *title, char *Str);
void debugPrint(char *strs);

int splitStr(char *source, char *start, char *stop, char *dis, int stat);
int checkStr(char *source, char *strSign, int timeOut);
int resetBuf(char *strBuf, int *indexBuf, int lenBuf);
int clcBuf(char *buf, char *sign, int *indexBuf);
int checkCmd(char *source, char *strSign, int timeOut);

void specFc();
int checkReqQTM95();
void resetQTM95fc();
int turnOffEchoM95();
int turnOnEchoM95();
int checkSIM();
int checkGSM();
int checkGPRS();

int configFGCNT();
int configQICSGP();
int configQINDI();
int configQIMUX();
int configQIMODE();
int configQIDNSIP();
int configTCP();
int configQIRD(char *sign);
int sendDOS(char *data);
int sendPONG();
int sendPub(char *strP);
int sendSub();
int openTCP();
int connectNat();
int closeTCP();
int checkTCP();

int encodeDat(char *dis);
int decodeDat(char *indat);
int getMSG();
//int getMSG(char *strmsg, char *dis);
int getDataServer();

void I2C_ByteWrite(I2C_TypeDef* I2Cx, u8 slaveAddr, u8* pBuffer,
		u16 NumByteToWrite);
void I2C_BufferRead(I2C_TypeDef* I2Cx, u8 slaveAddr, u8* pBuffer,
		u16 NumByteToRead);
void I2C_BufferRead_Addr(I2C_TypeDef* I2Cx, u8 slaveAddr, u8* pBuffer,
		u8 ReadAddr, u16 NumByteToRead);

void Delayus(__IO uint32_t nCount);

/************************ Config **************************/

void GPIO_Configuration(void) {
	GPIO_DeInit(GPIOA);
	GPIO_DeInit(GPIOB);
	GPIO_DeInit(GPIOC);

	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE); //RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	/* Configure output pushpull mode */
	GPIO_InitStructure.GPIO_Pin = GPS_LED | Buzzer;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; //GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; //GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = PWR_GSM | GSM_RST_Pin;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; //GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = PWR_GPS;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/************************** I2C config **************************************/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP | GPIO_Mode_IPU
			| GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	/************************** USART config **************************************/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);
	/********************************* PORTA *************************************/
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	/*________________________________ OUTPUT ___________________________________*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;    // TX - USART1
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/*________________________________ OUTPUT ___________________________________*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;    // TX - USART2
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/*________________________________ OUTPUT ___________________________________*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;    // TX - USART3
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	/*________________________________ INPUT ____________________________________*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;    // RX - USART1
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/*________________________________ INPUT ____________________________________*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;    // RX - USART2
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	/*________________________________ INPUT ____________________________________*/
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;    // RX - USART3
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	/*___________________________________________________________________________*/

