NguyenDuyThan/STM32_GPS_GSM/iTracking_Firmware/src/main.c
}

void USARTx_Configuration(USART_TypeDef* USARTx) {
	USART_InitTypeDef USART_InitStructure;

	if (USARTx == USART1)
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	else if (USARTx == USART2)
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	else if (USARTx == USART3)
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);

	USART_DeInit(USARTx);
	USART_InitStructure.USART_BaudRate = 115200;    // Cau hinh BaudRate
	USART_InitStructure.USART_WordLength = USART_WordLength_8b; // Cau hinh so Bit du lieu trong 1 khung truyen/nhan
																// USART_WordLength_8b
																// USART_WordLength_9b
	USART_InitStructure.USART_StopBits = USART_StopBits_1; // Cau hinh so Bit STOP trong khung truyen
														   // USART_StopBits_1
														   // USART_StopBits_0_5
														   // USART_StopBits_2
														   // USART_StopBits_1_5
	USART_InitStructure.USART_Parity = USART_Parity_No; // Cau hinh su dung che do Parity
														// USART_Parity_No
														// USART_Parity_Even
														// USART_Parity_Odd
	USART_InitStructure.USART_HardwareFlowControl =
	USART_HardwareFlowControl_None; // Cau hinh che do dieu khien theo luong
									// USART_HardwareFlowControl_None
									// USART_HardwareFlowControl_RTS
									// USART_HardwareFlowControl_CTS
									// USART_HardwareFlowControl_RTS_CTS
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; // Cau hinh che do truyen nhan
																	// USART_Mode_Rx
																	// USART_Mode_Tx
	USART_Init(USARTx, &USART_InitStructure);    // Cau hinh USART1

	USART_ITConfig(USARTx, USART_IT_RXNE, ENABLE); // Xay ra ngat khi thanh ghi du lieu nhan cua USART1 day
	//USART_ITConfig(USARTx, USART_IT_TXE, ENABLE);    // Xay ra ngat khi thanh ghi du lieu truyen cua USART1 trong

	USART_Cmd(USARTx, ENABLE);                  // Kich hoat USART1
	USART_ClearITPendingBit(USARTx, USART_IT_RXNE);
}

void I2C_Configuration(void) {
	I2C_InitTypeDef I2C_InitStructure;

#ifdef FAST_I2C_MODE
#define I2C_SPEED 400000
#define I2C_DUTYCYCLE I2C_DutyCycle_16_9
#else /* STANDARD_I2C_MODE*/
#define I2C_SPEED 100000
#define I2C_DUTYCYCLE I2C_DutyCycle_2
#endif /* FAST_I2C_MODE*/

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);

//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource8, GPIO_AF_I2C1);  // only connect to
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource9, GPIO_AF_I2C1); // only connect to
//	GPIO_PiGPIO_Mode_Out_ODnAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_I2C2);  // only connect to
//	GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_I2C2);  // only connect to

	/************************************* Master ******************************/
	/* I2C De-initialize */
	I2C_DeInit(I2C1);
	I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	I2C_InitStructure.I2C_DutyCycle = I2C_DUTYCYCLE;
	I2C_InitStructure.I2C_OwnAddress1 = 0x01;
	I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
	I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	I2C_Init(I2C1, &I2C_InitStructure);
	/* I2C ENABLE */
	I2C_Cmd(I2C1, ENABLE);
	/* Enable Interrupt */
//	I2C_ITConfig(I2C1, (I2C_IT_ERR ) , ENABLE);
//	I2C_ITConfig(I2C1, (I2C_IT_ERR | I2C_IT_EVT | I2C_IT_BUF) , ENABLE);
	/************************************* Slave ******************************/
	/* I2C De-initialize */
	/*	I2C_DeInit(I2C2);
	 I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
	 I2C_InitStructure.I2C_DutyCycle = I2C_DUTYCYCLE;
	 I2C_InitStructure.I2C_OwnAddress1 = Slave_Address;
	 I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
	 I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
	 I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
	 I2C_Init(I2C2, &I2C_InitStructure);*/
	/* I2C ENABLE */
	/*I2C_Cmd(I2C2, ENABLE);*/
	/* Enable Interrupt */
	/*I2C_ITConfig(I2C2, (I2C_IT_ERR | I2C_IT_EVT | I2C_IT_BUF), ENABLE);*/
}

void NVIC_Configuration(void) {
	NVIC_InitTypeDef NVIC_InitStructure;
//	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
//	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn ;
//	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
//	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
//	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//	NVIC_Init(&NVIC_InitStructure);

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	NVIC_InitStructure.NVIC_IRQChannel = I2C2_EV_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	NVIC_InitStructure.NVIC_IRQChannel = I2C2_ER_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

///////////////////////////////////////////////////////////////////

void USARTx_Sendchar(USART_TypeDef* USARTx, char Data) {
	while (USART_GetFlagStatus(USARTx, USART_FLAG_TC) == RESET)
		;
	USART_SendData(USARTx, Data);
}

char USARTx_Getchar(USART_TypeDef* USARTx) {
	char Data;
	while (USART_GetFlagStatus(USARTx, USART_FLAG_RXNE) == RESET)
		;
	Data = (char) USART_ReceiveData(USARTx);
	return Data;
}

void USARTx_SendString(USART_TypeDef* USARTx, char *Str) {
	while (*Str) {
		USARTx_Sendchar(USARTx, *Str);
		Str++;
	}
}

void I2C_ByteWrite(I2C_TypeDef* I2Cx, u8 slaveAddr, u8* pBuffer,
		u16 NumByteToWrite) {
	int i;
	/* Send START condition */
	I2C_GenerateSTART(I2Cx, ENABLE);
	/* Test on EV5 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for write */
	I2C_Send7bitAddress(I2Cx, slaveAddr, I2C_Direction_Transmitter);

