NguyenDuyThan/STM32_GPS_GSM/iTracking_Firmware/src/main.c
	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		;

	for (i = 0; i < NumByteToWrite; i++) {
		/* Send the byte to be written */
		I2C_SendData(I2Cx, pBuffer[i]);

		/* Test on EV8 and clear it */
		while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
			;
	}

	/* Send STOP condition */
	I2C_GenerateSTOP(I2Cx, ENABLE);
}

void I2C_BufferRead(I2C_TypeDef* I2Cx, u8 slaveAddr, u8* pBuffer,
		u16 NumByteToRead) {
	/* While the bus is busy */
	while (I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))
		;

	/* Send START condition */
	I2C_GenerateSTART(I2Cx, ENABLE);

	/* Test on EV5 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for write */
	I2C_Send7bitAddress(I2Cx, slaveAddr, I2C_Direction_Transmitter);

	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		;

	/* Clear EV6 by setting again the PE bit */
	I2C_Cmd(I2Cx, ENABLE);

	/* Send START condition a second time */
	I2C_GenerateSTART(I2Cx, ENABLE);

	/* Test on EV5 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for read */
	I2C_Send7bitAddress(I2Cx, slaveAddr, I2C_Direction_Receiver);

	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
		;

	/* While there is data to be read */
	while (NumByteToRead) {
		if (NumByteToRead == 1) {
			/* Disable Acknowledgement */
			I2C_AcknowledgeConfig(I2Cx, DISABLE);

			/* Send STOP Condition */
			I2C_GenerateSTOP(I2Cx, ENABLE);
		}

		/* Test on EV7 and clear it */
		if (I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED)) {
			/* Read a byte from the slave */
			*pBuffer = I2C_ReceiveData(I2Cx);

			/* Point to the next location where the byte read will be saved */
			pBuffer++;

			/* Decrement the read bytes counter */
			NumByteToRead--;
		}
	}

	/* Enable Acknowledgement to be ready for another reception */
	I2C_AcknowledgeConfig(I2Cx, ENABLE);
}

void I2C_BufferRead_Addr(I2C_TypeDef* I2Cx, u8 slaveAddr, u8* pBuffer,
		u8 ReadAddr, u16 NumByteToRead) {
	/* While the bus is busy */
	while (I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY))
		;

	/* Send START condition */
	I2C_GenerateSTART(I2Cx, ENABLE);

	/* Test on EV5 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for write */
	I2C_Send7bitAddress(I2Cx, slaveAddr, I2C_Direction_Transmitter);

	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		;

	/* Clear EV6 by setting again the PE bit */
	I2C_Cmd(I2Cx, ENABLE);

	/* Send the slave internal address to write to */
	I2C_SendData(I2Cx, ReadAddr);

	/* Test on EV8 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		;

	/* Send START condition a second time */
	I2C_GenerateSTART(I2Cx, ENABLE);

	/* Test on EV5 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for read */
	I2C_Send7bitAddress(I2Cx, slaveAddr, I2C_Direction_Receiver);

	/* Test on EV6 and clear it */
	while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
		;

	/* While there is data to be read */
	while (NumByteToRead) {
		if (NumByteToRead == 1) {
			/* Disable Acknowledgement */
			I2C_AcknowledgeConfig(I2Cx, DISABLE);

			/* Send STOP Condition */
			I2C_GenerateSTOP(I2Cx, ENABLE);
		}

		/* Test on EV7 and clear it */
		if (I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED)) {
			/* Read a byte from the slave */
			*pBuffer = I2C_ReceiveData(I2Cx);

			/* Point to the next location where the byte read will be saved */
			pBuffer++;

			/* Decrement the read bytes counter */
			NumByteToRead--;
		}
	}

	/* Enable Acknowledgement to be ready for another reception */
	I2C_AcknowledgeConfig(I2Cx, ENABLE);
}

/********************** Common Function **************************/

void splitDataGPS() {
	unsigned char data;
	data = USART_ReceiveData(USART3);
	if (data == '$') {
		indexBufRxDataUart3 = 1;
	} else if (data == '\n') {
		//bufRxDataUart3[indexBufRxDataUart3] = 0;
		bufRxDataUart3[indexBufRxDataUart3] = '\0';
		indexBufRxDataUart3 = 0;
		strncpy(chuoiphanbiet, bufRxDataUart3, 5);
		if (strcmp(chuoiphanbiet, gpgga) == 0) {
			strcpy(GPGGA, bufRxDataUart3);
			gpggalenght = indexBufRxDataUart3;
		} else if (strcmp(chuoiphanbiet, gpgsa) == 0) {
			strcpy(GPGSA, bufRxDataUart3);
			gpgsalenght = indexBufRxDataUart3;
		} else if (strcmp(chuoiphanbiet, gprmc) == 0) {
			strcpy(GPRMC, bufRxDataUart3);
			gprmclenght = indexBufRxDataUart3;
		}
	}
	if (indexBufRxDataUart3) {
		bufRxDataUart3[indexBufRxDataUart3 - 1] = data;
		indexBufRxDataUart3++;
	}
}

void getDataUart1() {
	unsigned char data;
	data = USART_ReceiveData(USART1);
	bufRxDataUart1[indexBufRxDataUart1] = data;
	indexBufRxDataUart1++;
}

void getDataUart2() {
	unsigned char data;
	data = (USART_ReceiveData(USART2) & 0x7F);
	if (indexBufRxDataUart2 == bufRxDataUart2Size)
		indexBufRxDataUart2 = 0;
	bufRxDataUart2[indexBufRxDataUart2] = data;
	indexBufRxDataUart2++;
}

void debugPrintCB(char *label, const char *title, char *Str, printcb endcb) {
	if (db.log)
		endcb(label, title, Str);
}

int checkStrCB(char *source, char *Strs, int time, checkStrcb endcheckStrcb) {
	return endcheckStrcb(source, Strs, time);
}

void debugWriteLog(char *label, const char *title, char *Str) {
	if ((Str != NULL) && (label != NULL) && (title != NULL)) {
		char chuoi[strlen(Str) + 20];
//		char *chuoi = pvPortMalloc(strlen(Str) + 20);
		memset(chuoi, 0, strlen(Str) + 20);
		strcpy(chuoi, label);
		strcat(chuoi, title);
		strcat(chuoi, ": ");
		strcat(chuoi, Str);
		strcat(chuoi, "\n\r");
		USARTx_SendString(USART1, chuoi);
//		vPortFree(chuoi);
//		if (strlen(bufLog) >= (bufLogSize - 200)) {
//			strcpy(&bufLog[0], &bufLog[0] + strlen(chuoi));
//			strcat(bufLog, chuoi);
//		} else {
//			strcat(bufLog, chuoi);
//		}
	}
}

