NguyenDuyThan/STM32_GPS_GSM/iTracking_Firmware/src/main.c
void debugPrint(char *strs) {
	USARTx_SendString(USART1, strs);
	USARTx_SendString(USART1, "\r\n");
}

/*---------------------------- checkStr -------------------------------------------
 * Brief: check a string in other string
 * Param:	source		|	IN	|	input source string.
 * 			strSign		|	IN	|	string will be search in source.
 * 			timeOut		|	IN	|	times (1 is 10 ms) to waiting for data in source to search.
 * Ret:		response if success 1, otherwise 0.
 -------------------------------------------------------------------------------*/

int checkStr(char *source, char *strSign, int timeOut) {
	int timePass = 0;
	if (source != NULL) {
		for (timePass = 0; timePass < timeOut; timePass++) {
			if (strstr(source, strSign) != NULL) {
				return 1;
			} else {
				vTaskDelay(10);
			}
		}
	}
	return 0;
}

/*----------------------------- splitStr ----------------------------------------
 * Brief: split string with string start and string stop
 * Param:	source			|	IN	|	input string will be split.
 * 			start			|	IN	|	word or string will be start with.
 * 			stop			|	IN	|	word or string will be stop with.
 * 			dis				|	OUT	|	store the string between start and stop after split.
 * 			stat			|	IN	|	status 1 if want to keep [start] and [stop], 0 for not.
 * Ret:		response if success 1, otherwise 0.
 * Example: source: "hello world"
 * 			start: "el"
 * 			stop:  "r"
 * 			->>> if stat is 1 dis: "ello wor"
 * 				if stat is 0 dis: "lo wo"
 -------------------------------------------------------------------------------*/

int splitStr(char *source, char *start, char *stop, char *dis, int stat) {
	uint8_t ret = 0;
	if ((source != NULL) && (start != NULL) && (stop != NULL)
			&& (dis != NULL)) {
		char srctemp[msgsize];
		memset(srctemp, 0, msgsize);
		strncpy(srctemp, source, strlen(source));
		if (stat == 1) {
			if (strstr(srctemp, start) != NULL) {
				strcpy(&srctemp[0], strstr(srctemp, start));
				if (strstr(srctemp, stop) != NULL) {
					char temp1[msgsize];
					strcpy(&temp1[0], strstr(srctemp, stop) + strlen(stop));
					strncpy(dis, srctemp, strlen(srctemp) - strlen(temp1));
					ret = 1;
				} else
					ret = 0;
			} else
				ret = 0;
		} else {
			if (strstr(srctemp, start) != NULL) {
				strcpy(&srctemp[0], strstr(srctemp, start) + strlen(start));
				if (strstr(srctemp, stop) != NULL) {
					char temp1[msgsize];
					strcpy(&temp1[0], strstr(srctemp, stop));
					strncpy(dis, srctemp, strlen(srctemp) - strlen(temp1));
					ret = 1;
				} else
					ret = 0;
			} else
				ret = 0;
		}
	}
	return ret;
}

/*---------------------------- clcBuf -------------------------------------------
 * Brief: clear buf before sign
 * Param:	buf			|	IN	|	input buffer will be clear.
 * 			sign		|	IN	|	word or string will be clear.
 * 			indexBuf	|	IN	|	only accept response with this header.
 * Ret:		response if success 1, otherwise 0.
 -------------------------------------------------------------------------------*/

int clcBuf(char *buf, char *sign, int *indexBuf) {
	char ret = 0;
	if ((buf != NULL) && (sign != NULL)) {
		if (strstr(buf, sign) != NULL) {
			strcpy(&buf[0], strstr(buf, sign) + strlen(sign));
			*indexBuf = strlen(buf);
			ret = 1;
		} else
			ret = 0;
	}
	return ret;
}

int checkCmd(char *source, char *strSign, int timeOut) {
	if (strstr(source, strSign)) {
		vTaskDelay(10);
		if (strstr(source, "buart2")) {
			debugInfo("buf current: ");
			debugInfo(bufRxDataUart2);
			return 1;
		}
		if (strstr(source, "test"))
			return test;
		if (strstr(source, "resetQTM95"))
			return resetQTM95;
		if (strstr(source, "run"))
			return run;
		if (strstr(source, "sendPUB")) {
			if (strstr(source, "msg") != NULL) {
				char *temp = pvPortMalloc(512);
				strcpy(&temp[0], strstr(source, "msg") + strlen("msg"));
				memset(strPub, 0, sizeof(strPub));
				if (strlen(temp) >= 200) {
					strncpy(strPub, temp, 100);
				} else {
					strcpy(&strPub[0], strstr(source, "msg") + strlen("msg"));
				}
				vPortFree(temp);
				return sendPUB;
			}
			return 100;
		}
		if (strstr(source, "sendSUB")) {
			return sendSUB;
		} else
			return NotFound;
	} else {
		return 100;
	}
}

int resetBuf(char *strBuf, int *indexBuf, int lenBuf) {
	memset(strBuf, 0, lenBuf);
	*indexBuf = 0;
	if (strlen(strBuf) >= 1)
		return 0;
	else
		return 1;
}

/*********************************************************************************/

int main(void) {
	dbQuecTelM95.log = 0;
	db.log = 1;
	msg.part = 0;
	msg.new = 0;

	GPIO_Configuration();
	I2C_Configuration();
	USARTx_Configuration(USART1);
	USARTx_Configuration(USART2);
	USARTx_Configuration(USART3);
	NVIC_Configuration();

	time_t t;
	srand((unsigned) time(&t));

	debugInfo("\n-------- *** Main *** ---------");
	debugInfo("------- Test iTracking --------");
	debugInfo(">>>>>>> Setup HardWare <<<<<<<");
	GPIO_SetBits(GPIOA, PWR_GPS);
	GPIO_SetBits(GPIOC, PWR_GSM);

	debugInfo(">>>>>>> OK.");
	debugInfo("Waiting for data to show...");

	xTaskCreate(TaskB, (signed char* )"TaskB", 2048, NULL, 4, NULL);
	xTaskCreate(TaskA, (signed char* )"TaskA", 512, NULL, 3, NULL);
	xTaskCreate(TaskC, (signed char* )"TaskC", 512, NULL, 2, NULL);
	xTaskCreate(TaskD, (signed char* )"TaskD", 128, NULL, 1, NULL);
	vTaskStartScheduler();
}

static void TaskA(void *pvParameters) {
	/*int index = 0;
	 char temp[100];
	 char title[6];//1
	 char time_UTC[11];//2
	 char latitude[10];//3
	 char NS[2];//4
	 char longtitude[10];//5
	 char EW[2];//6
	 char qualitiGPS[2];//7
	 char number_satellites[5];//8
	 char horizontal_dilution[10];//9
	 char antenna_sea[4];//10
	 char unit_antenna[2];//11
	 char Geoidal_separation[4];//12
	 char unit_Geoidal[2];//13
	 char Differential_GPS[4];//14
	 char station_ID[5];//15
	 char checksum[3];//16
	 strcpy(temp, GPRMC);
	 int st = strlen(GPRMC) - 4;
	 char *p;*/
	for (;;) {
#if debugA
		{
			p = strtok(temp, ",*"); //cat chuoi bang cac ky tu
			while (index < 16)
			{
				switch (index) {
					case 0:
					strcpy(title, p);
					index++;
					break; //optional
					case 1:
					strcpy(time_UTC, p);
					index++;
					break;//optional
					case 2:
					strcpy(latitude, p);
					index++;
					break;//optional
					case 3:
					strcpy(NS, p);
					index++;
					break;//optional
					case 4:
					strcpy(longtitude, p);
					index++;
					break;
					case 5:
					strcpy(EW, p);
					index++;
					break;
					case 6:
					strcpy(qualitiGPS, p);
					index++;
					break;
					case 7:
					strcpy(number_satellites, p);
					index++;
					break;
					case 8:
					strcpy(horizontal_dilution, p);
					index++;
					break;
					case 9:
					strcpy(antenna_sea, p);
					index++;
					break;
					case 10:
					strcpy(unit_antenna, p);
					index++;
					break;
					case 11:
					strcpy(Geoidal_separation, p);
					index++;
					break;
					case 12:
					strcpy(unit_Geoidal, p);
					index++;
					break;
					case 13:
					strcpy(Differe ntial_GPS, p);
					index++;
					break;
					case 14:
					strcpy(station_ID, p);
					index++;
					break;
					default://Optional
					index++;
					break;
				}
				//strcpy(b[index],p);
				//index++;
				p = strtok(NULL, ",*");//cat chuoi tu vi tri dung lai truoc do
			}

			USARTx_SendString(USART1, (char*) "Data getting from: ");
			USARTx_SendString(USART1, (char*) title);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Thoi gian UTC: ");
			USARTx_SendString(USART1, (char*) time_UTC);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Vi do: ");
			USARTx_SendString(USART1, (char*) latitude);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Huong vi do: ");
			USARTx_SendString(USART1, (char*) NS);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Kinh do: ");
			USARTx_SendString(USART1, (char*) longtitude);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Huong kinh do: ");
			USARTx_SendString(USART1, (char*) EW);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Chat luong GPS: ");
			USARTx_SendString(USART1, (char*) qualitiGPS);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "So ve tinh nhin thay: ");
			USARTx_SendString(USART1, (char*) number_satellites);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Duong chan troi: ");
			USARTx_SendString(USART1, (char*) horizontal_dilution);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1,
					(char*) "Do cao anten so voi nuoc bien: ");
			USARTx_SendString(USART1, (char*) antenna_sea);
			USARTx_SendString(USART1, (char*) " ");
			USARTx_SendString(USART1, (char*) unit_antenna);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Do tach roi hinh hoc: ");
			USARTx_SendString(USART1, (char*) Geoidal_separation);
			USARTx_SendString(USART1, (char*) " ");
			USARTx_SendString(USART1, (char*) unit_Geoidal);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Sai lech du lieu GPS: ");
			USARTx_SendString(USART1, (char*) Differential_GPS);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "ID kenh tham chieu vi sai: ");
			USARTx_SendString(USART1, (char*) station_ID);
			USARTx_SendString(USART1, (char*) "\n");
			USARTx_SendString(USART1, (char*) "Ma kiem tra: ");
			USARTx_SendString(USART1, (char*) checksum);
			USARTx_SendString(USART1, (char*) "\n");

			/*************************** part data temp ok 1 ****************************/
			USARTx_SendString(USART1,
					(char*) "******Luu GPGGA co gia tri la:\n");
			USARTx_SendString(USART1, (char*) GPGGA);
			USARTx_SendString(USART1, (char*) "\n");
		}
#endif // debugA
		vTaskDelay(500);
	}
}

static void TaskB(void *pvParameters) {
	uint8_t timeOpenTCP = 0;
	uint8_t timeNat = 0;
	startSIM: QTM95.runOpen = 1;
	QTM95.tcp = 0;
	QTM95.nat = 0;
	resetBufQTM95();
	if (checkSIM() != Good) {
		debugError("SIM Fail");
	} else if (checkGSM() != Good) {
		debugError("GSM Fail");
	} else if (checkGPRS() != Good) {
		debugError("GPRS not working, try to check again...");
	} else
		debugInfo("signal GSM Good");
	resetBufQTM95();
	while (1) {
		specFc();
		if(timeNat)
		if (QTM95.QIRDI) {
			if (getDataServer() == 0) {
				debugError("Cannot get data");
				debugPrint(bufRxDataUart2);
			}
			QTM95.QIRDI = 0;
		}
		if (QTM95.runOpen) {
			QTM95.nat = 0;
			QTM95.sendSub = 1;
			timeOpenTCP++;
			if (!openTCP()) {
				debugError("Open TCP fail");
			} else if ((!connectNat()) || (timeOpenTCP == 2)
					|| (timeOpenTCP == 4) || (timeOpenTCP == 6)
					|| (timeOpenTCP == 8)) {
				debugError(
						"Connect to Nat fail, try to close TCP and connect again...");
				if (closeTCP()) {
					debugWarn("TCP closed");
				} else {
					debugError("TCP cannot close");
				}
			} else {
				debugInfo("TCP ok, Wating for Nat respond...");
				QTM95.runOpen = 0;
			}
			if ((timeOpenTCP >= 10)) {
				debugWarn("cannot connect, try to retset QTM95...");
				resetQTM95fc();
				timeOpenTCP = 0;
				goto startSIM;
			}
		}
		if (QTM95.sendSub) {
				if (sendSub()) {
					debugInfo("SUB ok...");
					QTM95.sendSub = 0;
				} else {
					debugError("SUB fail, try send again...");
					QTM95.runOpen = 1;
				}
		}
		if (QTM95.sendPub) {
				char *buffer = pvPortMalloc(msgDataSend_size);
				memset(buffer, 0, msgDataSend_size);
				memset(&msgDataLocal, 0, sizeof(msgDataSend));
				if (strlen(strPub) >= 128) {
					strncpy(msgDataLocal.text1, strPub, 127);
					strncpy(&msgDataLocal.text2[0],
							strstr(strPub, msgDataLocal.text1) + 127, 127);
				} else {
					strncpy(msgDataLocal.text1, strPub, strlen(strPub));
					sprintf(msgDataLocal.text2,
							"Chuoi ngan qua cho vo Text 1 het rui\n");
				}
				memset(strPub, 0, sizeof(strPub));
				msgDataLocal.num1 = rand() % 50;
				msgDataLocal.num2 = rand() % 10;
				if (encodeDat(buffer)) {
					if (sendPub(buffer)) {
						debugInfo("Publish data to server is ok ^.^");
						QTM95.sendPub = 0;
					} else {
						QTM95.runOpen = 1;
						debugError("PUB fail, try to check connect...");
					}
				} else {
					debugError("Encode Data fail.");
				}
				vPortFree(buffer);
		}
		if (msg.new) {
			debugInfo("New data: ");
			char *bufferrec = pvPortMalloc(msgDataSend_size);
			memset(bufferrec, 0, msgDataSend_size);
			sprintf(bufferrec, "\nText1: %s\nNum1: %d\nText2: %s\nNum2: %d",
					msgDataServer.text1, msgDataServer.num1,
					msgDataServer.text2, msgDataServer.num2);
			debugPrint(bufferrec);
			vPortFree(bufferrec);
			msg.new = 0;
		}
		vTaskDelay(500);
	}
}

static void TaskC(void *pvParameters) {

