NguyenDuyThan/STM32_GPS_GSM/iTracking_Firmware/src/main.c
	for (;;) {
		switch (cmdCtrl("cmd")) {
		case NotFound:
			debugWarn("command not found^^^\n\r Please check again");
			break;
		case run:
			debugInfo("received Command: run");
			QTM95.runOpen = 10;
			break;
		case sendPUB:
			debugInfo("received Command: sendPUB");
			QTM95.sendPub = 1;
			break;
		case sendSUB:
			debugInfo("received Command: sendSUB");
			QTM95.sendSub = 1;
			break;
		case resetQTM95:
			debugInfo("received Command: resetQTM95");
			resetQTM95fc();
			break;
		default:
			break;
		}
		resetBuf(bufRxDataUart1, &indexBufRxDataUart1, bufRxDataUart1Size);
		vTaskDelay(100);
	}
}

static void TaskD(void *pvParameters) {

	for (;;) {
		I2C_ByteWrite(I2C1, Slave_Address, (u8*) MasterTxBuffer, 3);
		I2C_BufferRead(I2C1, Slave_Address, (u8*) MasterRxBuffer, 3);
		vTaskDelay(1000);
	}
}

/***************************** Network **********************************/

/*-------------------- GSM_Cmd -----------------------------
 * Brief: send AT command to module SIM over UART2
 * Param:	AT			|	IN	|	input AT command to send (Ex: "AT+CPIN?").
 * Ret:		Not.
 ----------------------------------------------------------*/

void GSM_Cmd(char *AT) {
	char *cmd = pvPortMalloc(strlen(AT) + 5);
	memset(cmd, 0, strlen(AT) + 5);
	strcpy(cmd, AT);
	strcat(cmd, "\r\n");
	USARTx_SendString(USART2, cmd);
	vPortFree(cmd);
}

void specFc() {
	if (checkReqQTM95() == QIRDI) {
		QTM95.QIRDI = 1;
		resetBufQTM95();
	}
}

int checkReqQTM95() {
	if (findStrSim("QIRDI:", 100)) {
		return QIRDI;
	}
	return NotFound;
}

void resetQTM95fc() {
	GPIO_SetBits(GPIOC, GSM_RST_Pin);
	vTaskDelay(200);
	GPIO_ResetBits(GPIOC, GSM_RST_Pin);
	vTaskDelay(10000);
	debugWarn("Reset Module QuecTelM95 OK");
}

int turnOffEchoM95() {
	GSM_Cmd("ATE0");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		return Good;
	} else {
		return NotRespond;
	}
}

int turnOnEchoM95() {
	GSM_Cmd("ATE1");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		return Good;
	} else {
		return NotRespond;
	}
}

int checkSIM() {
	uint8_t ret = 0;
	GSM_Cmd("AT+CPIN?");
	if (findStrSim("READY", 500)) {
		ret = Good;
	} else {
		ret = NotRespond;
	}
	return ret;
}

int checkGSM() {
	uint8_t ret = 0;
	GSM_Cmd("AT+GCAP");
	if (findStrSim("GSM", 500)) {
		ret = Good;
	} else {
		ret = NotRespond;
	}
	return ret;
}

int checkGPRS() {
	uint8_t ret = 0;
	GSM_Cmd("AT+CREG?");
	if (findStrSim("+CREG: 0,1", 1000)) {
		ret = Good;
	} else {
		GSM_Cmd("AT+CREG?");
		if (findStrSim("+CREG: 0,1", 1000)) {
			ret = Good;
		} else {
			ret = NotRespond;
		}
	}
	return ret;
}

int configFGCNT() {
	uint8_t ret = 0;
	GSM_Cmd("AT+QIFGCNT?");
	if (findStrSim("OK", 1000)) {
		if (findStrSim("+QIFGCNT: 0,", 500)) {
			ret = Good;
		} else {
			GSM_Cmd("AT+QIFGCNT=0");
			ret = Good;
		}
	} else
		ret = NotRespond;
	return ret;
}

int configQICSGP() {
	GSM_Cmd("AT+QICSGP=1,\"m-wap\"");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		return Good;
	} else if (strstr(bufRxDataUart2, "ERROR")) {
		return Warn;
	} else {
		return NotRespond;
	}
}

int configQIMUX() {
	GSM_Cmd("AT+QIMUX?");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		if (strstr(bufRxDataUart2, "+QIMUX: 0")) {
			return Good;
		} else {
			GSM_Cmd("AT+QIMUX=0");
			vTaskDelay(500);
			if (strstr(bufRxDataUart2, "OK")) {
				return Good;
			} else {
				return NotRespond;
			}
		}
	} else {
		return NotRespond;
	}
}

int configQIMODE() {
	GSM_Cmd("AT+QIMODE?");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		if (strstr(bufRxDataUart2, "+QIMOE: 0")) {
			return Good;
		} else {
			GSM_Cmd("AT+QIMODE=0");
			vTaskDelay(500);
			if (strstr(bufRxDataUart2, "OK")) {
				return Good;
			} else {
				return NotRespond;
			}
		}
	} else {
		return NotRespond;
	}
}

int configQINDI() {
	GSM_Cmd("AT+QINDI?");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		if (strstr(bufRxDataUart2, "+QINDI: 1")) {
			return Good;
		} else {
			GSM_Cmd("AT+QINDI=1");
			vTaskDelay(500);
			if (strstr(bufRxDataUart2, "OK")) {
				return Good;
			} else {
				return NotRespond;
			}
		}
	} else {
		return NotRespond;
	}
}

int configQIDNSIP() {
	GSM_Cmd("AT+QIDNSIP?");
	vTaskDelay(500);
	if (strstr(bufRxDataUart2, "OK")) {
		if (strstr(bufRxDataUart2, "+QIDNSIP: 1")) {
			return Good;
		} else {
			GSM_Cmd("AT+QIDNSIP=1");
			vTaskDelay(500);
			if (strstr(bufRxDataUart2, "OK")) {
				return Good;
			} else {
				return NotRespond;
			}
		}
	} else {
		return NotRespond;
	}
}

int configTCP() {
	if (!configFGCNT()) {
		return 0;
	} else if (!configQICSGP()) {
		return 0;
	} else if (!configQINDI()) {
		return 0;
	} else if (!configQIMUX()) {
		return 0;
	} else if (!configQIDNSIP()) {
		return 0;
	} else {
		resetBufQTM95();
		return 1;
	}
}

int closeTCP() {
	uint8_t ret = 0;
	GSM_Cmd("AT+QICLOSE");
	if (findStrSim("CLOSE OK", 1000)) {
		ret = 1;
	} else {
		GSM_Cmd("AT+QIDEACT");
		if (findStrSim("DEACT OK", 1000)) {
			ret = 1;
		} else
			ret = 0;
	}
	resetBufQTM95();
	return ret;
}

int sendDOS(char *data) {
	uint8_t ret = 0;
	uint8_t len = 0;
	len = strlen(data);
	char *cmd = pvPortMalloc(15);
	memset(cmd, 0, 15);
	sprintf(cmd, "AT+QISEND=%d", len);
	GSM_Cmd(cmd);
	if (findStrSim("> ", 1000)) {
		GSM_Cmd(data);
		GSM_Cmd("0x1A");
		if (findStrSim("SEND OK", 1000)) {
			ret = 1;
		} else if (findStrSim("SEND FAIL", 1)) {
			ret = 0;
		}
	} else if (findStrSim("ERROR", 1)) {
		ret = 0;
	}
	vPortFree(cmd);
	return ret;
}

int openTCP() {
	uint8_t ret = 0;
	if (checkTCP()) {
		ret = 1;
	} else {
		if (!configTCP()) {
			debugError("configTCP error, try to config again...");
			ret = 0;
		} else {
			GSM_Cmd("AT+QIOPEN= \"TCP\", \"itracking.vn\", 4222");
			if (findStrSim("CONNECT", 1000)) {
				if (findStrSim("FAIL", 1)) {
					ret = 0;
				} else
					ret = 1;
			}
		}
	}
	resetBufQTM95();
	return ret;
}

int connectNat() {
	uint8_t ret = 0;
	if (sendDOS(chuoiConnect)) {
		ret = 1;
	} else
		ret = 0;
	return ret;
}

int configQIRD(char *sign) {
	GSM_Cmd("AT+QIRD=0,1,0,1024");
	if (findStrSim(sign, 500)) {
		return Good;
	} else {
		return NotRespond;
	}
}

int sendPONG() {
	uint8_t ret = 0;
	char *cmd = pvPortMalloc(10);
	memset(cmd, 0, 10);
	sprintf(cmd, "PONG\r\n");
	if (sendDOS(cmd)) {
		ret = 1;
	} else
		ret = 0;
	vPortFree(cmd);
	return ret;
}

int sendPub(char *strP) {
	uint8_t ret = 0;
	int i = strlen(strP);
	char *strPsend = pvPortMalloc(i + 33);
	memset(strPsend, 0, i + 33);
	sprintf(strPsend, "PUB R.0000000000.CMD %d\r\n%s\r\n", strlen(strP), strP);
	if (sendDOS(strPsend)) {
		ret = 1;
	} else
		ret = 0;
	vPortFree(strPsend);
	return ret;
}

