NguyenDuyThan/STM32_GPS_GSM/iTracking_Firmware/src/main.c
int sendSub() {
	uint8_t ret = 0;
	if (sendDOS("SUB R.0000000000.CMD 1\r\n")) {
		ret = 1;
	} else
		ret = 0;
	return ret;
}

int encodeDat(char *dis) {
	uint8_t ret = 0;
	char buffer[msgDataSend_size];
	memset(buffer, 0, msgDataSend_size);
	pb_ostream_t stream = pb_ostream_from_buffer((pb_byte_t *) buffer,
			sizeof(buffer));
	if (pb_encode(&stream, msgDataSend_fields, &msgDataLocal)) {
		strncpy(dis, buffer, strlen(buffer));
//		sprintf(buffer, "Encoded size is %d\n", stream.bytes_written);
//		debugWarn(buffer);
		ret = 1;
	} else {
		ret = 0;
	}
	return ret;
}

int decodeDat(char *indat) {
//	debugWarn(indat);
	memset(&msgDataServer, 0, sizeof(msgDataSend));
	uint8_t ret = 0;
	char buffer[msgDataSend_size];
	memset(buffer, 0, msgDataSend_size);
	strncpy(buffer, indat, strlen(indat));
	pb_istream_t stream = pb_istream_from_buffer((pb_byte_t *) buffer,
			sizeof(buffer));
	if (pb_decode(&stream, msgDataSend_fields, &msgDataServer)) {
		ret = 1;
	} else
		ret = 0;
	return ret;
}

int getMSG() {
	uint8_t ret = 0;
	if (strstr(bufRxDataUart2, "TCP") != NULL) {
//		char *msgQIRD = pvPortMalloc(msgDataSend_size + 50);
		memset(msgQIRD, 0, msgDataSend_size + 50);
		if (splitStr(bufRxDataUart2, "+QIRD:", "\nOK\r\n", msgQIRD, 0)) {
//			char *lenTCP = pvPortMalloc(5);
			memset(lenTCP, 0, 5);
			splitStr(bufRxDataUart2, "TCP,", "\n", lenTCP, 0);
			if (lenTCP != NULL) {
				uint8_t lentcp = atoi(lenTCP);
//				char *strTCP = pvPortMalloc(msgDataSend_size + 40);
				memset(strTCP, 0, msgDataSend_size + 40);
//				strcpy(strTCP, msgQIRD);
				strncpy(&strTCP[0], strstr(msgQIRD, "\r\n") + 2, lentcp);
//				debugWarn("strTCP:");
//				debugPrint(strTCP);
				if (strstr(strTCP, "MSG") != NULL) {
//					char *strMSG = pvPortMalloc(msgDataSend_size + 30);
					memset(strMSG, 0, msgDataSend_size + 30);
//					strcpy(strMSG, strTCP);
					strcpy(&strMSG[0], strstr(strTCP, "MSG") + 23);
					if (strstr(strMSG, "\n") != NULL) {
//						char *temp1 = pvPortMalloc(msgDataSend_size + 30);
						char temp1[msgDataSend_size + 30];
						memset(temp1, 0, msgDataSend_size + 30);
//						char *lenmsg = pvPortMalloc(5);
						char lenmsg[5];
						memset(lenmsg, 0, 5);
						strcpy(&temp1[0],
								strstr(strMSG, "\r\n") + strlen("\r\n"));
						strncpy(lenmsg, strMSG, strlen(strMSG) - strlen(temp1));
						if (lenmsg != NULL) {
							msg.len = atoi(lenmsg);
							memset(msg.data, 0, msgsize);
							strncpy(msg.data, temp1, msg.len);
							if (strlen(msg.data) < msg.len) {
								ret = 2;
								msg.part = 1;
//								strcpy(&msg.data[0], strstr(strMSG, "\n") + 2);
//								debugWarn("msg.data 0:");
//								debugPrint(msg.data);
							} else if (strlen(msg.data) == msg.len) {
//								strncpy(msg.data, temp1, msg.len);
								msg.part = 0;
								ret = 1;
							} else {
								msg.part = 0;
								ret = 0;
							}
						} else {
							ret = 0;
						}
//						vPortFree(temp1);
//						vPortFree(lenmsg);
					} else {
						ret = 0;
					}
//					vPortFree(strMSG);
				} else {
					if (msg.part) {
						strcat(msg.data, strTCP);
//						debugWarn("msg.data 1:");
//						debugPrint(msg.data);
						if (strlen(msg.data) > msg.len) {
							char temp[msg.len + 10];
							memset(temp, 0, sizeof(temp));
							strcpy(temp, msg.data);
							memset(msg.data, 0, sizeof(msg.data));
							strncpy(msg.data, temp, msg.len);
							msg.part = 0;
							ret = 1;
						} else if (strlen(msg.data) < msg.len) {
							msg.part = 1;
							ret = 2;
						} else {
							msg.part = 0;
							ret = 1;
						}
					} else {
						ret = 0;
					}
				}
//				vPortFree(strTCP);
			} else { //no len TCP
				msg.part = 0;
				ret = 0;
			}
//			vPortFree(lenTCP);
		} else { //
			msg.part = 0;
			ret = 0;
		}
//		vPortFree(msgQIRD);
	} else { //no TCP
		ret = 0;
	}
	return ret;
}

int getDataServer() {
	uint8_t ret = 0;
	if (configQIRD("\r\nOK\r\n")) {
		if (findStrSim("+OK", 1)) {
			debugInfo("Connected to NAT");
			QTM95.nat = 1;
			QTM95.runOpen = 0;
		}
		if (findStrSim("ERR", 1)) {
			debugWarn("Connect NATs time out");
			debugWarn("Try to connect again");
			connectNat();
			debugBufQTM95(bufRxDataUart2);
			QTM95.nat = 0;
		}
		if (strstr(bufRxDataUart2, "PING") != NULL) {
			if (sendPONG()) {
				QTM95.ping = 0;
				debugInfo("PONG ok");
			} else {
				debugWarn("PONG lai FAIL, try to send PONG again");
				sendPONG();
				debugBufQTM95(bufRxDataUart2);
			}
		}
		uint8_t g = getMSG();
		if (g == 2) {
			debugWarn("Data not enough, waiting for more data...");
		} else if (g == 1) {
			if (decodeDat(msg.data)) {
				msg.new = 1;
			} else {
				debugError("Decode data fail");
			}
		} else {
			debugWarn("Not data");
		}
		ret = 1;
	} else {
		ret = 0;
	}
	return ret;
}

int checkTCP() {
	uint8_t ret = 0;
	GSM_Cmd("AT+QISTAT");
	if (findStrSim("CONNECT OK", 100)) {
		ret = 1;
	}
	return ret;
}

int waitSer(){
	uint8_t ret =0;
	if(QTM95.nat == 1){
		ret = 1;
	} else {

	}
}

/*************************** Accelerometer **************************/

/***************************** Other ********************************/

void Delayus(__IO uint32_t nCount) {
	while (nCount--) {
	}
}

/*
 void vApplicationIdleHook( void )
 {

 }
 */
#ifdef  USE_FULL_ASSERT
void assert_failed(char* file, uint32_t line)
{
	/* User can add his own implementation to report the file name and line number,
	 ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

	/* Infinite loop */
	while (1)
	{
	}
}
#endif
